README.org
#+OPTIONS: ^:nil
#+OPTIONS: toc:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+TITLE: cf-lib

Clojure bindings for the cloudfoundry api.
* Leiningen dependency
#+BEGIN_SRC clojure
[cf-lib "0.1.0-SNAPSHOT"]
#+END_SRC

